[
    {
      id: 1,
      name: "ScholarshipHub",
      image: "https://i.ibb.co/KpypCWf0/sholarship-Hub-banner.jpg",
      technologies: ["React", "Tailwind CSS", "MongoDB", "Stripe"],
      description:
        "ScholarshipHub is a comprehensive Scholarship Management System designed to assist students in searching for suitable universities and scholarships. It also facilitates the application process, allowing students to apply for scholarships directly through the platform. The system supports three types of users: default users, administrators, and moderators. Upon registration, a user is assigned the 'user' role by default. Administrators have the capability to change user roles as needed.",
      liveLink: "https://scholarship-hub-akash.netlify.app",
      githubLink: "https://github.com/abdulmazidakash/c-assignment-12-client-side",
      challenges: [
        " Make a pagination in all Scholarship pages",
        " Implement sorting/filtering function in Manage Applied Application in moderator and admin Dashboard.",
        "  Implement an analytics Chart page in the Admin dashboard",
      ],
      improvements: [
        "Add AI-powered recommendations.",
        "Optimize performance for faster loading.",
      ],
    },
    {
      id: 2,
      name: "GlobalVisaHub",
      image: "https://i.ibb.co/Z6fLkkMD/global-visa-hub.jpg",
      technologies: ["React", "Tailwind CSS", "MongoDB"],
      description:
        "A user-friendly Global Visa Hub platform that simplifies the process of exploring, applying, and managing visa applications.",
      liveLink: "https://assignment-10-global-visa-hub-akash.netlify.app",
      githubLink: "https://github.com/abdulmazidakash/c-assignment-10-visa-navigating-client",
      challenges: [
        " At the top of the “All visas” page, Add a dropdown menu where you will implement filter functionality based on visa types.",
        " Implement Search functionality on the “My visa applications” page based on the country name through an input field and a search button.",
        " Implement a dark/light theme toggle for the home page.",
      ],
      improvements: ["Implement advanced search and tagging functionalities."],
    },
    {
      id: 3,
      name: "Artifact Atlas",
      image: "https://i.ibb.co/Tq0Pp0cf/artifacts-banner-image.jpg",
      technologies: ["React", "Tailwind CSS", "MongoDB"],
      description:
        "Artifact Atlas is an interactive web platform for exploring and managing historical artifacts.",
      liveLink: "https://assignment-11-artifact-atlas.netlify.app",
      githubLink: "https://github.com/abdulmazidakash/c-assignment-11",
      challenges: [
        "Toggle Like Button The Like Button allows users to toggle between Liked and Disliked states.",
        "Search Functionality On the top of the All Artifacts Page",
      ],
      improvements: [" Add a spinner when the data is in a loading state."],
    },
  ]